y24moham/Two_axis_machine_STM32_Control/STM32+Python_GUI_CODE/w23_two_axis_project-limit_switch_yaseen/src/L6470.c
/**
  ******************************************************************************
  * @file       L6470.c
  * @date       01/10/2014 12:00:00
  * @brief      This file provides set of firmware functions to manage the
  *             L6470.
  ******************************************************************************
  *
  * COPYRIGHT(c) 2014 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "L6470.h"
#include "xnucleoihm02a1_interface.h"
#include "stdbool.h"
#include "stm32f4xx_hal.h"
#include "example_usart.h"

/**
  * @addtogroup BSP
  * @{
  */

/**
  * @addtogroup Components
  * @{
  */

/**
  * @addtogroup L6470
  * @{
  */
    
/**
  * @defgroup   L6470_Private_Constants
  * @brief      L6470 Private Constants.
  * @{
  */

/**
  * @brief Array whose elements are a structure in which store information about
  *        the L6470 Registers (the address, the names, the length in bits, the
  *        reset value)
  */
const sL6470_Register_t L6470_Register[L6470REGIDSIZE] = {
  {0x01, "ABS_POS",    22, 3, 0x000000},  //!< Current position
  {0x02, "EL_POS",      9, 2, 0x000},     //!< Electrical position
  {0x03 , "MARK",      22, 3, 0x000000},  //!< Mark position
  {0x04 , "SPEED",     20, 3, 0x0000},    //!< Current speed
  {0x05 , "ACC",       12, 2, 0x08A},     //!< Acceleration
  {0x06 , "DEC",       12, 2, 0x08A},     //!< Deceleration
  {0x07 , "MAX_SPEED", 10, 2, 0x041},     //!< Maximum speed
  {0x08 , "MIN_SPEED", 13, 2, 0x000},     //!< Minimum speed
  {0x15 , "FS_SPD",    10, 2, 0x027},     //!< Full-step speed
  {0x09 , "KVAL_HOLD",  8, 1, 0x29},      //!< Holding KVAL
  {0x0A , "KVAL_RUN",   8, 1, 0x29},      //!< Constant speed KVAL
  {0x0B , "KVAL_ACC",   8, 1, 0x29},      //!< Acceleration starting KVAL
  {0x0C , "KVAL_DEC",   8, 1, 0x29},      //!< Deceleration starting KVAL
  {0x0D , "INT_SPEED", 14, 2, 0x0408},    //!< Intersect speed
  {0x0E , "ST_SLP",     8, 1, 0x19},      //!< Start slope
  {0x0F , "FN_SLP_ACC", 8, 1, 0x29},      //!< Acceleration final slope
  {0x10 , "FN_SLP_DEC", 8, 1, 0x29},      //!< Deceleration final slope
  {0x11 , "K_THERM",    4, 1, 0x0},       //!< Thermal compensation factor
  {0x12 , "ADC_OUT",    5, 1, 0x00},      //!< ADC output, (the reset value is according to startup conditions)
  {0x13 , "OCD_TH",     4, 1, 0x8},       //!< OCD threshold
  {0x14 , "STALL_TH",   7, 1, 0x40},      //!< STALL threshold
  {0x16 , "STEP_MODE",  8, 1, 0x7},       //!< Step mode
  {0x17 , "ALARM_EN",   8, 1, 0xFF},      //!< Alarm enable
  {0x18 , "CONFIG",    16, 2, 0x2E88},    //!< IC configuration
  {0x19 , "STATUS",    16, 2, 0x0000}     //!< Status, (the reset value is according to startup conditions)
};

/**
  * @brief Array whose elements are a structure in which store information about
  *        the L6470 Application Commands (the mnemonic name, the number of
  *        needed parameters, the related funtion to call)
  */
const sL6470_ApplicationCommand_t L6470_ApplicationCommand[L6470APPCMDIDSIZE] =  {
  {"NOP",         0x00, 0},
  {"SETPARAM",    0x00, 2},
  {"GETPARAM",    0x20, 1},
  {"RUN",         0x50, 2},
  {"STEPCLOCK",   0x58, 1},
  {"MOVE",        0x40, 2},
  {"GOTO",        0x60, 1},
  {"GOTO_DIR",    0x68, 2},
  {"GOUNTIL",     0x82, 3},
  {"RELEASESW",   0x92, 2},
  {"GOHOME",      0x70, 0},
  {"GOMARK",      0x78, 0},
  {"RESETPOS",    0xD8, 0},
  {"RESETDEVICE", 0xC0, 0},
  {"SOFTSTOP",    0xB0, 0},
  {"HARDSTOP",    0xB8, 0},
  {"SOFTHIZ",     0xA0, 0},
  {"HARDHIZ",     0xA8, 0},
  {"GETSTATUS",   0xD0, 0}
};

/**
  * @brief The mnemonic names for the L6470 direction
  */
const sL6470_Direction_t L6470_Direction[L6470DIRIDSIZE] = {
  {"REV", 0x00},  //!< Reverse direction
  {"FWD", 0x01}   //!< Forward direction
};

/**
  * @brief Action taken about ABS_POS register
  */
const sL6470_ACT_t L6470_ACT[L6470ACTIDSIZE] = {
  {"RST", 0x00},  //!< ABS_POS register is reset
  {"CPY", 0x01}   //!< ABS_POS register value is copied into the MARK register
};

/**
  * @}
  */ /* End of L6470_Private_Constants */

/**
  * @defgroup   L6470_Private_Macros
  * @brief      L6470 Private Macros.
  * @{
  */
#define L6470_SPI_Communication     HAL_SPI_TransmitReceive   //!< Rename the HAL function to transmit and receive data via SPI
#define _DELAY(TDISCS)              for(delay_cnt=0; delay_cnt<20; delay_cnt++) __NOP()   //!<Simply deselect time delay for SPI nCS
/**
  * @}
  */ /* End of L6470_Private_Macros */

/**
  * @defgroup   L6470_Private_Variables
  * @brief      L6470 Private Variables.
  * @{
  */

/**
  * @brief      L6470 Application Command
  */
StepperMotorCommand_t L6470Command =
{
  L6470_SetParam,
  L6470_GetParam,
  L6470_Run,
  L6470_StepClock,
  L6470_Move,
  L6470_GoTo,
  L6470_GoToDir,
  L6470_GoUntil,
  L6470_ReleaseSW,
  L6470_GoHome,
  L6470_GoMark,
  L6470_ResetPos,
  L6470_ResetDevice,
  L6470_SoftStop,
  L6470_HardStop,
  L6470_SoftHiZ,
  L6470_HardHiZ,
  L6470_GetStatus,
  L6470_PrepareSetParam,
  L6470_PrepareGetParam,
  L6470_PrepareRun,
  L6470_PrepareStepClock,
  L6470_PrepareMove,
  L6470_PrepareGoTo,
  L6470_PrepareGoToDir,
  L6470_PrepareGoUntil,
  L6470_PrepareReleaseSW,
  L6470_PrepareGoHome,
  L6470_PrepareGoMark,
  L6470_PrepareResetPos,
  L6470_PrepareResetDevice,
  L6470_PrepareSoftStop,
  L6470_PrepareHardStop,
  L6470_PrepareSoftHiZ,
  L6470_PrepareHardHiZ,
  L6470_PrepareGetStatus,
  L6470_CheckStatusRegisterFlag,
};

sL6470_AppCmdPkg_t L6470_AppCmdPkg[L6470DAISYCHAINSIZE];                             //!< To store the identifier of the actual L6470 application command and its the needed parameters
uint8_t L6470_DaisyChainSpiTxStruct[L6470MAXSPICMDBYTESIZE][L6470DAISYCHAINSIZE];  //!< To store the matrix that contains the command data that are going to be sent by SPI to the L6470 daisy chain
uint8_t L6470_DaisyChainSpiRxStruct[L6470MAXSPICMDBYTESIZE][L6470DAISYCHAINSIZE];  //!< To store the matrix that contains the received data by SPI from the L6470 daisy chain
eFlagStatus_t L6470_DaisyChain_HalfPrepared = ZERO_F;                                     //!< Boolean variable used when more than one L6470 into the daisy chain is going to be addressed for commanding
sL6470_StatusRegister_t L6470_StatusRegister;                                          //!< To store the received L6470_StatusRegister
sL6470_StatusRegister_t *pL6470_StatusRegister = &L6470_StatusRegister;                //!< Pointer to the L6470_StatusRegister variable
uint8_t delay_cnt;                                                                    //!< To be used into simply deselect time delay for SPI nCS
volatile bool fault_detected = false;                                                 //!< To be used to detect if a fault has occurred and stop any motion of motors
volatile bool manual_control = false;                                                   //!< To be used to detect if the motor is under manual control using the uart commands and stop any motion of motors if a fault condition has been detected and motor is already in motion (MOT_STATUS_ID flag is 0 when motor is not inmotion) to avoid potential issues with sudden changes in motor speed when the motor is stopped, and to ensure that the motor speed is only updated when the motor is already in motion for better performance and reliability
volatile bool manual_stopped[2] = {false, false};                                     //!< To be used to detect if the motor is stopped due to manual control using the uart commands and add an additional non-blocking delay to allow the motor to respond to the stop command before potentially updating it again with a new ADC value, this can help in providing smoother motor control and avoiding potential issues with sudden changes in motor speed due to ADC value changes when manual control is active and the motor was stopped due to manual control
uint8_t debounce_delay_ms = 20;                                                          //!< To be used to create a delay in milliseconds for switch debouncing
uint32_t motor_0_speed_min = 0;
uint32_t motor_0_speed_max = 7000; // The maxinum speed for the horizontal motor is set to 7000 to make it more controllable in the area provided, as it is connected directly to the horizontal stage without any gear reduction, and the horizontal stage has pulley with direct motion transfer, so the maximum speed is set to 7000, which is more than enough for the horizontal stage to move in the provided area in a reasonable time and with good controllability, and it also helps to avoid potential issues with sudden changes in motor speed when the motor is stopped, and to ensure that the motor speed is only updated when the motor is already in motion for better performance and reliability
uint32_t motor_1_speed_min = 0;
uint32_t motor_1_speed_max = 70000; // The maxinum speed for the vertical motor is set to 70000 to make it easier to move in the area provided, as it is connected to the vertical stage with alead screw, so many revolutions translate to a very little travel distance, so the maximum speed is set to 70000, which is enough for the vertical stage to move in the provided area in a reasonable time and with good controllability, and the resistance on the motor due to the weight helps avoid potential issues with sudden changes in motor speed when the motor is stopped, and to ensure that the motor speed is only updated when the motor is already in motion for better performance and reliability
volatile uint32_t motor_0_speed = 0; // The initial speed for the horizontal motor is set to 0 to ensure that the motor is not in motion at the beginning, and to avoid potential issues with sudden changes in motor speed when the motor is stopped, and to ensure that the motor speed is only updated when the motor is already in motion for better performance and reliability
volatile uint32_t motor_1_speed = 0; // The initial speed for the vertical motor is set to 0 to ensure that the motor is not in motion at the beginning, and to avoid potential issues with sudden changes in motor speed when the motor is stopped, and to ensure that the motor speed is only updated when the motor is already in motion for better performance and reliability
void No_Interrupt_Delay_ms(uint32_t delay_ms){
  uint32_t t = delay_ms*5000;
  for (volatile uint64_t i = 0; i < t; i++) {}
};                                                   //!< To be used to create a delay in milliseconds
volatile eL6470_DirId_t motor_direction[2] = {L6470_DIR_FWD_ID, L6470_DIR_REV_ID}; // The initial direction for both motors is set to reverse (REV) to make it easier to move in the area provided, as they are connected directly to their respective stages without any gear reduction, and the stages have pulleys with direct motion transfer, so the initial directions are set to reverse (REV), which is more suitable for the stages to move in the provided area with good controllability, and it also helps to avoid potential issues with sudden changes in motor speed when the motors are stopped, and to ensure that the motor speeds are only updated when the motors are already in motion for better performance and reliability
/**
  * @}
  */ /* End of L6470_Private_Variables */

/* Function Prototypes -------------------------------------------------------*/

/**
  * @defgroup L6470_Private_Functions
  * @brief    L6470 Private Functions.
  * @{
  */

void L6470_ResetAppCmdPkg(sL6470_AppCmdPkg_t* pL6470_AppCmdPkg);
void L6470_FillAppCmdPkg(uint8_t L6470_Id, sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, eL6470_AppCmdId_t L6470_AppCmdId, uint32_t p1, uint32_t p2, uint32_t p3);
void L6470_PrepareAppCmdPkg(uint8_t L6470_Id, sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, eL6470_AppCmdId_t L6470_AppCmdId, uint32_t p1, uint32_t p2, uint32_t p3);
void L6470_PrepareDaisyChainCommand(sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, uint8_t* pL6470_DaisyChainSpiTxStruct);

/**
  * @}
  */ /* End of L6470_Private_Functions */

/**
  * @addtogroup L6470_Private_Functions
  * @{
  */

/**
  * @brief  Reset the structure used to store the identifier of the L6470
  *         application command and its the needed parameters.
  * @param  L6470_AppCmdPkg   The structure to be reset.
  */
void L6470_ResetAppCmdPkg(sL6470_AppCmdPkg_t* pL6470_AppCmdPkg)
{
  uint8_t id;
  
  for(id=0; id<L6470DAISYCHAINSIZE; id++)
  {
    (pL6470_AppCmdPkg+id)->L6470_AppCmdId=(eL6470_AppCmdId_t)0;
    (pL6470_AppCmdPkg+id)->p1=0;
    (pL6470_AppCmdPkg+id)->p2=0;
    (pL6470_AppCmdPkg+id)->p3=0;
  }
}

/**
  * @brief  Fill the structure used to store the identifier of the L6470
  *         application command and its the needed parameters.
  * @param  L6470_Id          The identifier of the L6470 target inside the daisy chain.
  * @param  L6470_AppCmdPkg   The structure to be filled.
  * @param  L6470_AppCmdId    The identifier of the L6470 application command to be sent.
  * @param  p1                The 1st parameter (if it is not needed it will be not considered).
  * @param  p2                The 2nd parameter (if it is not needed it will be not considered).
  * @param  p3                The 3rd parameter (if it is not needed it will be not considered).
  */
void L6470_FillAppCmdPkg(uint8_t L6470_Id, sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, eL6470_AppCmdId_t L6470_AppCmdId, uint32_t p1, uint32_t p2, uint32_t p3)
{
  (pL6470_AppCmdPkg+L6470_Id)->L6470_AppCmdId = L6470_AppCmdId;
  (pL6470_AppCmdPkg+L6470_Id)->p1 = p1;
  (pL6470_AppCmdPkg+L6470_Id)->p2 = p2;
  (pL6470_AppCmdPkg+L6470_Id)->p3 = p3;
}

/**
  * @brief  This function will fill the column of the L6470_AppCmdPkg related
  *         the L6470 to be addressed inside the daisy chain.
  *
  * @param  L6470_Id          The identifier of the L6470 target inside the daisy chain.
  * @param  pL6470_AppCmdPkg  Pointer to the sL6470_AppCmdPkg_t to be filled.
  * @param  L6470_AppCmdId    The identifier of the L6470 application command to be sent.
  * @param  p1                The 1st parameter (if it is not needed it will be not considered).
  * @param  p2                The 2nd parameter (if it is not needed it will be not considered).
  * @param  p3                The 3rd parameter (if it is not needed it will be not considered).
  */
void L6470_PrepareAppCmdPkg(uint8_t L6470_Id, sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, eL6470_AppCmdId_t L6470_AppCmdId, uint32_t p1, uint32_t p2, uint32_t p3)
{
  if(!L6470_DaisyChain_HalfPrepared)
  {
    L6470_DaisyChain_HalfPrepared = ONE_F; /* To avoid to delete the previous entered command */
    L6470_ResetAppCmdPkg(pL6470_AppCmdPkg);
  }
  
  L6470_FillAppCmdPkg(L6470_Id, pL6470_AppCmdPkg, L6470_AppCmdId, p1, p2, p3);
}

/**
  * @brief  This function will translate the data inside the L6470_AppCmdPkg into
  *         the right data to be sent via SPI to the L6470 daisy chain.
  *
  * @param  pL6470_AppCmdPkg              Pointer to the sL6470_AppCmdPkg_t to be filled.
  * @param  pL6470_DaisyChainSpiTxStruct  Pointer to the structure used by SPI to send the commands.
  */
void L6470_PrepareDaisyChainCommand(sL6470_AppCmdPkg_t* pL6470_AppCmdPkg, uint8_t* pL6470_DaisyChainSpiTxStruct)
{
  uint8_t PkgId;
  uint8_t PARAMLengthBytes; /* The number of bytes related to the numeric value for the addressed register */
  uint8_t spibyte;
  uint8_t i;
  
