y24moham/Two_axis_machine_STM32_Control/STM32+Python_GUI_CODE/w23_two_axis_project-limit_switch_yaseen/src/L6470.c
  /* Reset the structure used to send the command to the L6470 Daisy Chain through the SPI */
  i = 0;
  for(spibyte=0;spibyte<L6470MAXSPICMDBYTESIZE;spibyte++)
    for(PkgId=0; PkgId<L6470DAISYCHAINSIZE; PkgId++)
      *(pL6470_DaisyChainSpiTxStruct+(i++)) = 0x00;
  
  for(PkgId=0; PkgId<L6470DAISYCHAINSIZE; PkgId++)
  {
    /* Build the 1st bytes to transmit with the binary code of the command */
    *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) = (L6470_ApplicationCommand[(pL6470_AppCmdPkg+PkgId)->L6470_AppCmdId].BinaryCode);
    
    /* Perform the related L6470_AppCmdId */
    switch((pL6470_AppCmdPkg+PkgId)->L6470_AppCmdId)
    {
    case L6470_NOP_ID:
      break;
    case L6470_SETPARAM_ID:
      /* Build the 1st bytes to transmit (PARAM) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Register[((pL6470_AppCmdPkg+PkgId)->p1)].Address);
      
      /* The length, in byte, of this register (PARAM) is... */
      PARAMLengthBytes = L6470_Register[((pL6470_AppCmdPkg+PkgId)->p1)].LengthByte;
      
      /* Build the others bytes to transmit (VALUE) */
      for (spibyte=1; spibyte<(PARAMLengthBytes+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p2) >> (8*(PARAMLengthBytes-spibyte)));
      }
      break;
    case L6470_GETPARAM_ID:
      /* Build the 1st bytes to transmit (PARAM) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Register[((pL6470_AppCmdPkg+PkgId)->p1)].Address);
      break;
    case L6470_RUN_ID:
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode);
      
      /* Build the others bytes to transmit (SPD) */
      for (spibyte=1; spibyte<(3+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p2) >> (8*(3-spibyte)));
      }
      break;
    case L6470_STEPCLOCK_ID:
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode);
      break;
    case L6470_MOVE_ID:
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode);
      
      /* Build the others bytes to transmit (N_STEP) */
      for (spibyte=1; spibyte<(3+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p2) >> (8*(3-spibyte)));
      }      
      break;
    case L6470_GOTO_ID:
      /* Build the others bytes to transmit (ABS_POS) */
      for (spibyte=1; spibyte<(3+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p1) >> (8*(3-spibyte)));
      }
      break;
    case L6470_GOTODIR_ID:
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode);
      
      /* Build the others bytes to transmit (ABS_POS) */
      for (spibyte=1; spibyte<(3+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p2) >> (8*(3-spibyte)));
      }
      break;
    case L6470_GOUNTIL_ID:
      /* Build the 1st bytes to transmit (ACT) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= ((L6470_ACT[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode)<<3);
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p2)].BinaryCode);
      
      /* Build the others bytes to transmit (SPD) */
      for (spibyte=1; spibyte<(3+1); spibyte++)
      {
        *(pL6470_DaisyChainSpiTxStruct+((spibyte*L6470DAISYCHAINSIZE)+PkgId)) = (uint8_t)(((pL6470_AppCmdPkg+PkgId)->p3) >> (8*(3-spibyte)));
      }
      break;
    case L6470_RELEASESW_ID:
      /* Build the 1st bytes to transmit (ACT) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= ((L6470_ACT[((pL6470_AppCmdPkg+PkgId)->p1)].BinaryCode)<<3);
      /* Build the 1st bytes to transmit (DIR) */
      *(pL6470_DaisyChainSpiTxStruct+((0*L6470DAISYCHAINSIZE)+PkgId)) |= (L6470_Direction[((pL6470_AppCmdPkg+PkgId)->p2)].BinaryCode);
      break;
    case L6470_GOHOME_ID:
      break;
    case L6470_GOMARK_ID:
      break;
    case L6470_RESETPOS_ID:
      break;
    case L6470_RESETDEVICE_ID:
      break;
    case L6470_SOFTSTOP_ID:
      break;
    case L6470_HARDSTOP_ID:
      break;
    case L6470_SOFTHIZ_ID:
      break;
    case L6470_HARDHIZ_ID:
      break;
    case L6470_GETSTATUS_ID:
      break;
    }
  }
}

/**
  * @}
  */ /* End of L6470_Private_Functions */

/**
  * @addtogroup L6470_Exported_Functions
  * @{
  */

/**
  * @addtogroup L6470_Conversion_Functions
  * @brief      The following functions act just on one driver inside the L6470
  *             daisy chain. The command is immediately sent.
  * @{
  */

 /**
  * @brief  Convert the absolute position as 2's complement format into the signed number.
  * 
  * @param  AbsPos      The absolute position in the range from [-(2^21)] to [+(2^21)-1].
  * @retval Position    The position as signed number.
  */
int32_t AbsPos_2_Position(uint32_t AbsPos)
{
  if (AbsPos > L6470_MAX_POSITION)
    return (AbsPos - (L6470_POSITION_RANGE + 1));
  else
    return AbsPos;
}

/**
  * @brief  Convert the position as signed number into absolute position as 2's complement format.
  * 
  * @param  Position    The position as signed number.
  * @retval AbsPos      The absolute position in the range from [-(2^21)] to [+(2^21)-1].
  */
uint32_t Position_2_AbsPos(int32_t Position)
{
  if ((Position >= 0) && (Position <= L6470_MAX_POSITION))
    return Position;
  else
  {
    if ((Position >= L6470_MIN_POSITION) && (Position < 0))
      return (Position + (L6470_POSITION_RANGE + 1));
    else
      return (L6470_POSITION_RANGE + 1);        // OVF
  }
}

/**
  * @brief  Convert the SPEED register value into step/s.
  * 
  * @param  Speed       The SPEED register value.
  * @retval step/s      The speed as step/s.
  */
float Speed_2_Step_s(uint32_t Speed)
{
  return (Speed * ((float)14.9012e-3));
}

/**
  * @brief  Convert the speed as step/s into a right value for SPEED register.
  * 
  * @param  step/s      The speed as step/s.
  * @retval Speed       The SPEED register value.
  */
uint32_t Step_s_2_Speed(float Step_s)
{
  if (Step_s <= (L6470_MAX_SPEED * ((float)14.9012e-3)))
    return (uint32_t)(Step_s / ((float)14.9012e-3));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the ACC register value into step/(s^2).
  * 
  * @param  Acc         The ACC register value.
  * @retval step/(s^2)  The acceleration as step/(s^2).
  */
float Acc_2_Step_s2(uint16_t Acc)
{
  if (Acc <= L6470_MAX_ACC)
    return (Acc * ((float)1.4552e1));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the acceleartion as step/(s^2) into a right value for ACC register.
  * 
  * @param  step/(s^2)  The acceleration as step/(s^2).
  * @retval Acc         The ACC register value.
  */
uint16_t Step_s2_2_Acc(float Step_s2)
{
  if (Step_s2 <= (L6470_MAX_ACC * ((float)1.4552e1)))
    return (uint16_t)(Step_s2 / ((float)1.4552e1));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the DEC register value into step/(s^2).
  * 
  * @param  Dec         The DEC register value.
  * @retval step/(s^2)  The deceleration as step/(s^2).
  */
float Dec_2_Step_s2(uint16_t Dec)
{
  if (Dec <= L6470_MAX_DEC)
    return (Dec * ((float)1.4552e1));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the deceleration as step/(s^2) into a right value for DEC register.
  * 
  * @param  step/(s^2)  The deceleration as step/(s^2).
  * @retval Dec         The DEC register value.
  */
uint16_t Step_s2_2_Dec(float Step_s2)
{
  if (Step_s2 <= (L6470_MAX_DEC * ((float)1.4552e1)))
    return (uint16_t)(Step_s2 / ((float)1.4552e1));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the MAX_SPEED register value into step/s.
  * 
  * @param  MaxSpeed    The MAX_SPEED register value.
  * @retval step/s      The max speed as step/s.
  */
float MaxSpeed_2_Step_s(uint16_t MaxSpeed)
{
  if (MaxSpeed <= L6470_MAX_MAX_SPEED)
    return (MaxSpeed * ((float)15.2588));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the max speed as step/s into a right value for MAX_SPEED register.
  * 
  * @param  step/s      The max speed as step/s.
  * @retval MaxSpeed    The MAX_SPEED register value.
  */
uint16_t Step_s_2_MaxSpeed(float Step_s)
{
  if (Step_s <= (L6470_MAX_MAX_SPEED * ((float)15.2588)))
    return (uint16_t)(Step_s / ((float)15.2588));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the MIN_SPEED register value into step/s.
  * 
  * @param  MinSpeed    The MIN_SPEED register value.
  * @retval step/s      The min speed as step/s.
  */
float MinSpeed_2_Step_s(uint16_t MinSpeed)
{
  if (MinSpeed <= L6470_MAX_MIN_SPEED)
    return (MinSpeed * ((float)238.4186e-3));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the min speed as step/s into a right value for MIN_SPEED register.
  * 
  * @param  step/s      The min speed as step/s.
  * @retval MinSpeed    The MIN_SPEED register value.
  */
uint16_t Step_s_2_MinSpeed(float Step_s)
{
  if (Step_s <= (L6470_MAX_MIN_SPEED * ((float)238.4186e-3)))
    return (uint16_t)(Step_s / ((float)238.4186e-3));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the FS_SPD register value into step/s.
  * 
  * @param  FsSpd       The FS_SPD register value.
  * @retval step/s      The full-step speed as step/s.
  */
float FsSpd_2_Step_s(uint16_t FsSpd)
{
  if (FsSpd <= L6470_MAX_FS_SPD)
    return ((FsSpd+0.5) * ((float)15.25));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the full-step speed as step/s into a right value for FS_SPD register.
  * 
  * @param  step/s      The full-step speed as step/s.
  * @retval FsSpd       The FS_SPD register value.
  */
uint16_t Step_s_2_FsSpd(float Step_s)
{
  if (Step_s <= ((L6470_MAX_FS_SPD+0.5) * ((float)15.25)))
    return (uint16_t)((float)(Step_s / ((float)15.25)) - (float)0.5);
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the INT_SPEED register value into step/s.
  * 
  * @param  IntSpeed    The INT_SPEED register value.
  * @retval step/s      The intersect speed as step/s.
  */
float IntSpeed_2_Step_s(uint16_t IntSpeed)
{
  if (IntSpeed <= L6470_MAX_INT_SPEED)
    return (IntSpeed * ((float)59.6046e-3));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the intersect speed as step/s into a right value for INT_SPEED register.
  * 
  * @param  step/s      The full-step speed as step/s.
  * @retval FsSpd       The FS_SPD register value.
  */
uint16_t Step_s_2_IntSpeed(float Step_s)
{
  if (Step_s <= (L6470_MAX_INT_SPEED * ((float)59.6046e-3)))
    return (uint16_t)(Step_s / ((float)59.6046e-3));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the ST_SLP register value into s/step.
  * 
  * @param  StartSlope  The ST_SLP register value.
  * @retval s/step      The start slope as s/step.
  */
float StSlp_2_s_Step(uint8_t StSlp)
{
//  if (StSlp <= L6470_MAX_ST_SLP)
    return (StSlp * ((float)1.5686e-5));
//  else
//    return 0;   // Warning
}

/**
  * @brief  Convert the intersect speed as step/s into a right value for INT_SPEED register.
  * 
  * @param  step/s      The full-step speed as step/s.
  * @retval FsSpd       The FS_SPD register value.
  */
uint8_t s_Step_2_StSlp(float s_Step)
{
  if (s_Step <= (L6470_MAX_ST_SLP * ((float)1.5686e-5)))
    return (uint8_t)(s_Step / ((float)1.5686e-5));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the INT_SPEED register value into step/s.
  * 
  * @param  IntSpeed    The INT_SPEED register value.
  * @retval step/s      The intersect speed as step/s.
  */
float FnSlpAcc_2_s_Step(uint8_t FnSlpAcc)
{
//  if (FnSlpAcc <= L6470_MAX_FN_SLP_ACC)
    return (FnSlpAcc * ((float)1.5686e-5));
//  else
//    return 0;   // Warning
}

/**
  * @brief  Convert the intersect speed as step/s into a right value for INT_SPEED register.
  * 
  * @param  step/s      The full-step speed as step/s.
  * @retval FsSpd       The FS_SPD register value.
  */
uint8_t s_Step_2_FnSlpAcc(float s_Step)
{
  if (s_Step <= (L6470_MAX_FN_SLP_ACC * ((float)1.5686e-5)))
    return (uint8_t)(s_Step / ((float)1.5686e-5));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the INT_SPEED register value into step/s.
  * 
  * @param  IntSpeed    The INT_SPEED register value.
  * @retval step/s      The intersect speed as step/s.
  */
float FnSlpDec_2_s_Step(uint8_t FnSlpDec)
{
//  if (FnSlpDec <= L6470_MAX_FN_SLP_DEC)
    return (FnSlpDec * ((float)1.5686e-5));
//  else
//    return 0;   // Warning
}

/**
  * @brief  Convert the intersect speed as step/s into a right value for INT_SPEED register.
  * 
  * @param  step/s      The full-step speed as step/s.
  * @retval FsSpd       The FS_SPD register value.
  */
uint8_t s_Step_2_FnSlpDec(float s_Step)
{
  if (s_Step <= (L6470_MAX_FN_SLP_DEC * ((float)1.5686e-5)))
    return (uint8_t)(s_Step / ((float)1.5686e-5));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the OCD_TH register value into mA.
  * 
  * @param  OcdTh       The OCD_TH register value.
  * @retval mA          The overcurrent threshold as mA.
  */
float OcdTh_2_mA(uint8_t OcdTh)
{
  if (OcdTh <= L6470_MAX_OCD_TH)
    return ((OcdTh+1) * ((float)375));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the overcurrent threshold as mA into a right value for OCD_TH register.
  * 
  * @param  mA          The overcurrent threshold as mA.
  * @retval OcdTh       The OCD_TH register value.
  */
uint8_t mA_2_OcdTh(float mA)
{
  float result, decimal;
  
  if (mA <= ((L6470_MAX_OCD_TH+1) * ((float)375)))
  {
    result = (mA / ((float)375));
    decimal = result - (uint8_t)result;
    
    if (decimal < (float)0.5)
      return ((uint8_t)result - 1);
    else
      return ((uint8_t)result);    
  }
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the STALL_TH register value into mA.
  * 
  * @param  StallTh     The STALL_TH register value.
  * @retval mA          The stall detection threshold as mA.
  */
float StallTh_2_mA(uint8_t StallTh)
{
  if (StallTh <= L6470_MAX_STALL_TH)
    return ((StallTh+1) * ((float)31.25));
  else
    return 0;   // Warning
}

/**
  * @brief  Convert the stall detection threshold as mA into a right value for STALL_TH register.
  * 
  * @param  mA          The stall detection threshold as mA.
  * @retval StallTh     The STALL_TH register value.
  */
uint8_t mA_2_StallTh(float mA)
{
  float result, decimal;
  
  if (mA <= ((L6470_MAX_STALL_TH+1) * ((float)31.25)))
  {
    result = (mA / ((float)31.25));
    decimal = result - (uint8_t)result;
    
    if (decimal < (float)0.5)
      return ((uint8_t)result - 1);
    else
      return ((uint8_t)result);    
  }
  else
    return 0;   // Warning
}

/**
  * @}
  */ /* End of L6470_Conversion_Functions */

/**
  * @addtogroup L6470_AppCMDs
  * @{
  */

/**
  * @brief  SetParam command sets the register value equal to a new value.
  * 
  * @param  L6470_Id      The identifier of the L6470 target inside the daisy chain.
  * @param  L6470_RegId   The identifier of the L6470 register to be addressed.
  * @param  Value         The new value.
  */
void L6470_SetParam(uint8_t L6470_Id, eL6470_RegId_t L6470_RegId, uint32_t Value)
{
  L6470_PrepareAppCmdPkg(L6470_Id, L6470_AppCmdPkg, L6470_SETPARAM_ID, L6470_RegId, Value, 0);
  L6470_PrepareDaisyChainCommand(L6470_AppCmdPkg, (uint8_t*)L6470_DaisyChainSpiTxStruct);
  L6470_DaisyChainCommand((uint8_t*)L6470_DaisyChainSpiTxStruct, (uint8_t*)L6470_DaisyChainSpiRxStruct);
}

/**
  * @brief  GetParam command reads the register value.
  * 
  * @param  L6470_Id      The identifier of the L6470 target inside the daisy chain.
  * @param  L6470_RegId   The identifier of the L6470 register to be addressed.
  * 
  * @retval ReceivedValue The register value.
  */
uint32_t L6470_GetParam(uint8_t L6470_Id, eL6470_RegId_t L6470_RegId)
{
  uint8_t ValueLengthByte;
  uint32_t ReceivedValue;

