y24moham/Two_axis_machine_STM32_Control/STM32+Python_GUI_CODE/w23_two_axis_project-limit_switch_yaseen/src/L6470.c
  if (SW1_reading == GPIO_PIN_RESET && SW2_reading == GPIO_PIN_RESET && fault_detected == false) //motor 0 both switches triggered,
  {
    No_Interrupt_Delay_ms(debounce_delay_ms);
    SW1_reading = HAL_GPIO_ReadPin(switch1_port, switch1_pin);
    SW2_reading = HAL_GPIO_ReadPin(switch2_port, switch2_pin);
    if (SW1_reading == GPIO_PIN_RESET && SW2_reading == GPIO_PIN_RESET) //motor 0 both switches still triggered after debounce delay go into fault mode and stop both motors
    {
      L6470_HardStop(MOTOR_0);
      L6470_HardStop(MOTOR_1);
      fault_detected = true;
      set_error_LED(true);
      motor_set = true;
    }
  }
  if (SW1_reading == GPIO_PIN_RESET && motor_set == false && fault_detected == false) //motor 0 right switch triggered PA9
  {
    No_Interrupt_Delay_ms(debounce_delay_ms);
    SW1_reading = HAL_GPIO_ReadPin(switch1_port, switch1_pin);
    if (SW1_reading == GPIO_PIN_RESET) //motor 0 right switch still triggered after debounce delay
    {
      motor_direction[motor_id] = L6470_DIR_FWD_ID;
      L6470_Run(motor_id, L6470_DIR_FWD_ID, motor_speed);
      motor_set = true;
      No_Interrupt_Delay_ms(20); //delay to allow the motor to start before checking for switch state again
    }
  }
  if (SW2_reading == GPIO_PIN_RESET && motor_set == false && fault_detected == false) //motor 0 left switch triggered PA8
  {
    No_Interrupt_Delay_ms(debounce_delay_ms);
    SW2_reading = HAL_GPIO_ReadPin(switch2_port, switch2_pin);
    if (SW2_reading == GPIO_PIN_RESET) //motor 0 left switch still triggered after debounce delay
    {
      motor_direction[motor_id] = L6470_DIR_REV_ID;
      L6470_Run(motor_id, L6470_DIR_REV_ID, motor_speed);
      motor_set = true;
      No_Interrupt_Delay_ms(20); //delay to allow the motor to start before checking for switch state again
    }
  }
  if (motor_set == false && fault_detected == false) //motor with no switch triggered
  {
    L6470_Run(motor_id, motor_direction[motor_id], motor_speed);
    motor_set = true;
    No_Interrupt_Delay_ms(20); //delay to allow the motor to start before checking for switch state again
  }

}

/**
 * @brief  Set the error LED state.
 * @param  state The state to set the error LED to, true for on and false for off.
 */
void set_error_LED(bool state)
{
  if (state)
  {
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);
  }
  else
  {
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
  }
}

void SW_interrupt(uint8_t motor_id, GPIO_TypeDef*switch1_port, uint16_t switch1_pin, GPIO_TypeDef *switch2_port, uint16_t switch2_pin, uint32_t motor_speed, eL6470_DirId_t set_direction)
{
  if (HAL_GPIO_ReadPin(switch1_port, switch1_pin) == GPIO_PIN_RESET && fault_detected == false)
  {
    // check if the other switch for the horizontal axis is also triggered, if so then it is a fault condition and both motors should be stopped
    if (HAL_GPIO_ReadPin(switch2_port, switch2_pin) == GPIO_PIN_RESET && fault_detected == false)
    {
      L6470_HardStop(MOTOR_0);
      L6470_HardStop(MOTOR_1);
      fault_detected = true;
      set_error_LED(true);
    }
    else
    {
      volatile eL6470_DirId_t current_direction = L6470_CheckStatusRegisterFlag(motor_id, DIR_ID);
      if (manual_control == true) // if the motor is currently being controlled manually then stop the motor and wait for the switch to be released before allowing any more changes, this is to prevent multiple triggers from switch bounce or from the user holding the switch down
      {
        uint8_t opposite_motor_id = (motor_id == MOTOR_0) ? MOTOR_1 : MOTOR_0;
        L6470_HardStop(opposite_motor_id); //stop the opposite motor to prevent it from running into its switch while this switch is still triggered, and therefore avoiding breaking it as the other motor's interrupt might not be triggered if this switch is still triggered
        manual_stopped[opposite_motor_id] = true; //set the opposite motor as manually stopped to prevent it from being controlled again until the switch is released
        
        L6470_HardStop(motor_id); //stop the motor that triggered the interrupt to switch direction smoothly and safely
        No_Interrupt_Delay_ms(10); //delay to allow the motor to stop before changing direction
        L6470_Run(motor_id, set_direction, (motor_id == MOTOR_0) ? motor_0_speed_max : motor_1_speed_max);
        while (HAL_GPIO_ReadPin(switch1_port, switch1_pin) == GPIO_PIN_RESET)
        {
          //wait for the switch to be released before allowing any more changes, this is to prevent multiple triggers from switch bounce or from the user holding the switch down
          // check if the other switch for the same axis is also triggered, if so then it is a fault condition and both motors should be stopped
          if (HAL_GPIO_ReadPin(switch2_port, switch2_pin) == GPIO_PIN_RESET)
          {
            L6470_HardStop(MOTOR_0);
            L6470_HardStop(MOTOR_1);
            fault_detected = true;
            set_error_LED(true);
          }
        }
        No_Interrupt_Delay_ms(50); //delay to allow the motor to start before checking for switch state again
        manual_stopped[motor_id] = true; //allow the motor to be controlled again after the switch is released
        L6470_HardStop(motor_id);
        No_Interrupt_Delay_ms(10); //delay to allow the motor to stop before changing direction
      }
      else if (current_direction == set_direction) // if the motor is already running in the direction of the triggered switch then just send the run signal again to ensure the motor keeps running, this is to prevent the motor from stopping if the switch is triggered multiple times due to switch bounce or if the user holds the switch down
      {
        motor_direction[motor_id] = set_direction;
        L6470_Run(motor_id, set_direction, motor_speed);
      }
      else // if the motor is running in the opposite direction of the triggered switch then stop the motor and change direction, this is to prevent the motor from stalling if the switch is triggered multiple times due to switch bounce or if the user holds the switch down
      {
        L6470_HardStop(motor_id);
        No_Interrupt_Delay_ms(10); //delay to allow the motor to stop before changing direction

        motor_direction[motor_id] = set_direction;
        L6470_Run(motor_id, set_direction, motor_speed);
        No_Interrupt_Delay_ms(20); //delay to allow the motor to stop before changing direction
      }
    }
  }
}

/**
  * @}
  */ /* End of L6470_Exported_Functions */

/**
  * @}
  */ /* End of L6470 */

/**
  * @}
  */ /* End of Components */

/**
  * @}
  */ /* End of BSP */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
